In [2]:
import pandas as pd

In [3]:
ds=pd.DataFrame({'name':['nav','amar','joh','moh'],'rollno':[1,2,3,4],'sub':['eng','math','scien','soc']})

In [4]:
ds

   name  rollno    sub
0   nav       1    eng
1  amar       2   math
2   joh       3  scien
3   moh       4    soc

In [5]:
df=pd.DataFrame({'name':['tiru','andh','chen','kar','jai'],'rollno':[1,2,3,4,5],'sub':['hind','eng','mat','eco','com']})

In [6]:
df

   name  rollno   sub
0  tiru       1  hind
1  andh       2   eng
2  chen       3   mat
3   kar       4   eco
4   jai       5   com

In [7]:
ma=pd.merge(ds,df,on='rollno',how='left')

In [8]:
ma

  name_x  rollno  sub_x name_y sub_y
0    nav       1    eng   tiru  hind
1   amar       2   math   andh   eng
2    joh       3  scien   chen   mat
3    moh       4    soc    kar   eco

In [9]:
maxx=pd.merge(ds,df,on='rollno',how='right')

In [10]:
maxx

  name_x  rollno  sub_x name_y sub_y
0    nav       1    eng   tiru  hind
1   amar       2   math   andh   eng
2    joh       3  scien   chen   mat
3    moh       4    soc    kar   eco
4    NaN       5    NaN    jai   com

In [11]:
nxx=pd.merge(ds,df,on='rollno')

In [12]:
nxx

  name_x  rollno  sub_x name_y sub_y
0    nav       1    eng   tiru  hind
1   amar       2   math   andh   eng
2    joh       3  scien   chen   mat
3    moh       4    soc    kar   eco